urbanFlow/wStock/urans/summer/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
convertToMeters 1;
vertices ( (-1424.0473351583933 -1421.3374681379646 0) (3560.118337895983 -1421.3374681379646 0) (3560.118337895983 1421.3374681379646 0) (-1424.0473351583933 1421.3374681379646 0) (-1424.0473351583933 -1421.3374681379646 146.5) (3560.118337895983 -1421.3374681379646 146.5) (3560.118337895983 1421.3374681379646 146.5) (-1424.0473351583933 1421.3374681379646 146.5) );
blocks ( hex (0 1 2 3 4 5 6 7) (50 40 20) simpleGrading (1 1 1) );
boundary ( 
    inlet { type patch; faces ((0 3 7 4)); } 
    outlet { type patch; faces ((1 5 6 2)); } 
    ground { type wall; faces ((0 1 2 3)); } 
    frontAndBack { type symmetry; faces ((0 4 5 1) (3 2 6 7)); } 
    sky { type patch; faces ((4 5 6 7)); } 
);