urbanFlow/wStock/urans/summer/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
solvers
{
    p { solver GAMG; tolerance 1e-6; relTol 0.05; smoother GaussSeidel; }
    pFinal { $p; relTol 0; }
    turb { solver smoothSolver; smoother symGaussSeidel; tolerance 1e-7; relTol 0.1; }
    "(U|k|omega)" { $turb; }
    "(U|k|omega)Final" { $turb; relTol 0; }
}
PIMPLE { nOuterCorrectors 2; nCorrectors 2; nNonOrthogonalCorrectors 2; momentumPredictor yes; }
relaxationFactors
{
    fields { p 0.3; }
    equations { U 0.7; "(U|k|omega).*" 0.7; }
}